In [1]:
import numpy as np
import pandas as pd
import re
import sys
sys.path.append("clean_functions.py")
from src.clean_functions import *

In [2]:
shark = pd.read_csv("shark.csv",encoding = "ISO-8859-1")
shark_cop = pd.read_csv("shark_co.csv",encoding = "ISO-8859-1")

## Limpieza y Extracción de datos.

En este documento realizaremos la limpieza y extraccion de los datos, necesarios para formular nuestra hiótesis:

#### Primero:

* Realizaremos la limpieza de las diferentes columnas. 
* Valoraremos la posiblilidad de reemplazar valores Nan por valores que no influyan en el valor general de los datos. 

#### Segundo:

* Extraeremos los datos necesarios para nuestra poder visualizar los datos, con gráficos.

#### Tercero:

* Exportaremos los datos a nuestro repositorio.

In [3]:
shark

      Unnamed: 0    year             country sex_ fatal_(y/n)
0              0  2018.0                 USA    F           N
1              1  2018.0                 USA    F           N
2              2  2018.0                 USA    M           N
3              3  2018.0           AUSTRALIA    M           N
4              4  2018.0              MEXICO    M           N
...          ...     ...                 ...  ...         ...
6297        6297     0.0           AUSTRALIA    M           Y
6298        6298     0.0           AUSTRALIA    M           Y
6299        6299     0.0                 USA    M           Y
6300        6300     0.0              PANAMA    M           Y
6301        6301     0.0  CEYLON (SRI LANKA)    M           Y

[6302 rows x 5 columns]

In [4]:
shark.drop(["Unnamed: 0"],axis=1,inplace=True)

In [5]:
shark.rename(columns={'fatal_(y/n)': 'fatal_YN'}, inplace=True)

In [6]:
shark.sample()

        year country sex_ fatal_YN
5829  1879.0   INDIA    M        Y

#### 1. Limpieza de columna fatal_YN

In [7]:
shark.fatal_YN.value_counts()

N          4293
Y          1388
UNKNOWN      71
 N            7
M             1
2017          1
N             1
y             1
Name: fatal_YN, dtype: int64

In [8]:
shark.fatal_YN.isna().sum()

539

* Aunque casi todos los valores, estan agrupados en 'N' y 'Y', hay varios que no. Trataré de clasificarlos, Y y N, accediendo a dus celdas con el método, **Loc**.

In [9]:
shark.loc[(shark["fatal_YN"] == '2017')]

       year country sex_ fatal_YN
786  2012.0   ITALY    M     2017

In [10]:
shark.loc[(shark["fatal_YN"] == 'UNKNOWN')]

        year    country sex_ fatal_YN
624   2013.0        USA    F  UNKNOWN
1270  2008.0  AUSTRALIA    M  UNKNOWN
2250  1997.0     BRAZIL    M  UNKNOWN
2260  1997.0        USA    M  UNKNOWN
2267  1996.0  AUSTRALIA    M  UNKNOWN
...      ...        ...  ...      ...
6167  1617.0      INDIA  NaN  UNKNOWN
6169  1595.0      INDIA    M  UNKNOWN
6171  1555.0        NaN    M  UNKNOWN
6172  1554.0     FRANCE    M  UNKNOWN
6277     0.0  AUSTRALIA    M  UNKNOWN

[71 rows x 4 columns]

In [11]:
shark.loc[(shark["fatal_YN"] == ' N')]

        year           country sex_ fatal_YN
3942  1960.0         AUSTRALIA    F        N
3944  1960.0         AUSTRALIA    M        N
3946  1960.0         AUSTRALIA    M        N
3948  1960.0         AUSTRALIA    M        N
3949  1960.0         AUSTRALIA    M        N
3951  1960.0        NEW GUINEA    M        N
3956  1960.0  PAPUA NEW GUINEA    M        N

In [12]:
shark.loc[(shark["fatal_YN"] == 'N ')]

        year    country sex_ fatal_YN
5427  1909.0  AUSTRALIA  NaN       N

In [13]:
shark.loc[(shark["fatal_YN"] == 'y')]

        year country sex_ fatal_YN
6117  1815.0  TOBAGO    M        y

In [14]:
shark[shark.isna().any(axis=1)].sample(3)

        year country sex_ fatal_YN
2230  1997.0  MEXICO    M      NaN
2811  1986.0     USA  NaN        N
4846  1937.0   ITALY  NaN      NaN

###### Se han podido recuperar algunos datos sin mucho esfuerzo.

In [15]:
shark['fatal_YN'].replace([' N', 'N ' ],'N', inplace=True)
shark['fatal_YN'].replace('y', 'Y', inplace=True)
shark['fatal_YN'].replace(['M','2017','UNKNOWN'],np.nan, inplace=True)

In [16]:
shark.fatal_YN.value_counts()

N    4301
Y    1389
Name: fatal_YN, dtype: int64

In [17]:
shark.fatal_YN.isna().sum()

612

#### 2. Limpieza de columna sex.

In [18]:
shark.sex_.isna().sum()

565

In [19]:
shark.loc[(shark["sex_"] == 'M ')]

        year    country sex_ fatal_YN
563   2014.0        USA   M         N
1587  2005.0  AUSTRALIA   M         N

In [20]:
shark.loc[(shark["sex_"] == 'N')]

        year    country sex_ fatal_YN
4938  1934.0  AUSTRALIA    N        N
6131  1801.0        NaN    N        Y

In [21]:
shark_cop.loc[(shark_cop["Sex "] == 'N')]

,Unnamed: 0,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
4938,4938,1934.07.11,11-Jul-1934,1934.0,Boating,AUSTRALIA,New South Wales,Cronulla,Fishing,"18' boat, occupants William & Leslie Newton",...,"Blue pointer, 11'","G.P. Whitley, ref: Daily Telegraph, 7/11/1934 ...",1934.07.11-Newton-boat-Australia.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1934.07.11,1934.07.11,1365.0,NaN,NaN
6131,6131,1801.12.18.R,Reported 18-Dec-1801,1801.0,Provoked,NaN,NaN,NaN,Standing on landed shark's tail,Stephen Pettigew,...,12' shark,"The Evening Post, 12/18/1801",1801.12.18.R-Pettigrew.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1801.12.18.R,1801.12.18.R,172.0,NaN,NaN

* Realizando una breve búsqueda en internet, se aprecia que es un varon (Male)que murio a manos de un tiburon de 12'feet (https://sharkattackfile.net/spreadsheets/pdf_directory/1801.12.18.R-Pettigrew.pdf)
* Por otro lado, William & Leslie Newton tambien fuero atacados y mortalmente eridos por un tiburon.
(https://sharkattackfile.net/spreadsheets/pdf_directory/1934.07.11-Newton-boat-Australia.pdf)

In [22]:
shark.loc[(shark["sex_"] == 'lli')]

        year country sex_ fatal_YN
1624  2004.0     USA  lli        N

In [23]:
shark_cop.loc[(shark_cop["Sex "] == 'lli')]

,Unnamed: 0,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
1624,1624,2004.11.11.b,11-Nov-2004,2004.0,Unprovoked,USA,California,"Bunkers, Humboldt Bay, Eureka, Humboldt County",Surfing,Brian Kang,...,5.5 m [18'] white shark,"R. Collier, GSAF",2004.11.11.b-Kang.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2004.11.11.b,2004.11.11.b,4679.0,NaN,NaN

In [24]:
shark.loc[(shark["sex_"] == '.')]

        year           country sex_ fatal_YN
5437  1908.0  PAPUA NEW GUINEA    .        Y

In [25]:
shark_cop.loc[(shark_cop["Sex "] == '.')]

,Unnamed: 0,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
5437,5437,1908.06.02.R,Reported 02-Jun-1908,1908.0,Sea Disaster,PAPUA NEW GUINEA,New Britain,Matupi,.,NaN,...,Allegedly a 33-foot shark,"Taranaki Herald, 6/2/1908",1908.06.02.R-Matupi.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1908.06.02.R,1908.06.02.R,866.0,NaN,NaN

In [26]:
shark['sex_'].replace(['M ', 'N', 'lli' ],'M', inplace=True)
shark['sex_'].replace('.',np.nan, inplace=True)

#### 3. Columna de países.

In [27]:
dict_countries = dict(shark.country.value_counts())
filtro_1 = dict(shark.country.value_counts() > 50)
filtro_2 = [k for k,v in filtro_1.items() if v == True]
filtro_3 = {k:value for k,v in filtro_1.items() if v == True for key,value in dict_countries.items() if key == k }
filtro_4 = {'country':list(filtro_3.keys()),'incidents':list(filtro_3.values())}
filtro_5 = pd.DataFrame(filtro_4)

In [28]:
filtro_5

             country  incidents
0                USA       2229
1          AUSTRALIA       1338
2       SOUTH AFRICA        579
3   PAPUA NEW GUINEA        134
4        NEW ZEALAND        128
5             BRAZIL        112
6            BAHAMAS        109
7             MEXICO         89
8              ITALY         71
9               FIJI         62
10       PHILIPPINES         61
11           REUNION         60
12     NEW CALEDONIA         53

####  4. Aislamos los DF y los exportamos, lo s datos de la primera Hipótesis.

Aunque previamente ya habíamos aislado un DF, por paises queremos aislarlo no solo par paises sino por numero de indicias fatales y no fatales. 

Esa operación será realizada, continuación.

In [29]:
shark_1 = shark.copy()

In [30]:
regroup_1 = shark_1.groupby(['fatal_YN'])['country'].value_counts()

In [31]:
regroup_2 = regroup_1 .unstack().T
regroup_2.columns

Index(['N', 'Y'], dtype='object', name='fatal_YN')

In [32]:
regroup_3 = regroup_2.reset_index()

In [33]:
regroup_3.fillna(0)

fatal_YN            country     N    Y
0               PHILIPPINES   0.0  1.0
1                     TONGA   1.0  2.0
2         ADMIRALTY ISLANDS   1.0  0.0
3                    AFRICA   0.0  1.0
4                   ALGERIA   0.0  1.0
..                      ...   ...  ...
196                 VIETNAM  13.0  2.0
197             WEST INDIES   0.0  2.0
198           WESTERN SAMOA   0.0  1.0
199                   YEMEN   0.0  2.0
200                  YEMEN    1.0  5.0

[201 rows x 3 columns]

In [34]:
regroup_3['incidentes'] = regroup_3.fillna(0)['N']+regroup_3.fillna(0)['Y']

In [35]:
regroup_3=regroup_3[regroup_3["incidentes"]>50]

In [36]:
regroup_4= regroup_3.set_index("country")

In [37]:
regroup_4.sort_values(['incidentes'], ascending=False,inplace=True)

In [38]:
regroup_4 = regroup_4.reset_index()

In [39]:
regroup_4

fatal_YN           country       N      Y  incidentes
0                      USA  1837.0  186.0      2023.0
1                AUSTRALIA   921.0  283.0      1204.0
2             SOUTH AFRICA   407.0  106.0       513.0
3         PAPUA NEW GUINEA    74.0   56.0       130.0
4              NEW ZEALAND    91.0   24.0       115.0
5                  BAHAMAS    94.0   10.0       104.0
6                   BRAZIL    64.0   38.0       102.0
7                   MEXICO    35.0   43.0        78.0
8                     FIJI    39.0   22.0        61.0
9                  REUNION    31.0   29.0        60.0
10             PHILIPPINES    21.0   35.0        56.0
11                   ITALY    40.0   14.0        54.0
12           NEW CALEDONIA    34.0   18.0        52.0

In [41]:
regroup_4.columns = ['country','survived','died','incidents']

In [42]:
regroup_4 = regroup_4.set_index("country")

In [43]:
regroup_4.sample()

         survived  died  incidents
country
MEXICO       35.0  43.0       78.0

In [ ]:
regroup_4.to_csv('incidents_by_countries.csv')

####  4. Aislamos los DF y los exportamos, lo s datos de la Segunda Hipótesis.

In [44]:
shark_2 = shark.copy()

In [46]:
shark_2.sample()

        year country sex_ fatal_YN
1496  2006.0    FIJI    M        N

In [52]:
hipotesis_2 = pd.DataFrame(shark_2,columns = ['sex_','fatal_YN']).value_counts().unstack()

In [54]:
hipotesis_2

fatal_YN     N     Y
sex_
F          468   107
M         3484  1174

In [55]:
hipotesis_2.columns = ['injured','dead']

In [56]:
hipotesis_2

      injured  dead
sex_
F         468   107
M        3484  1174

##### Exportamos la Hipótesis 2.

In [ ]:
hipotesis_2.to_csv('incidents_by_gender.csv')